In [1]:
import sqlite3

### Creating DB and Connection

In [16]:
#creating db and cursor for executing the commands 
connection=sqlite3.connect("Newdb.db")
cursor=connection.cursor()

#### Creating Table

In [4]:
#created the table and commit it to the connection
cursor.execute('''
Create table if not exists employee(
               id integer primary key,
               name text not null,
               age int,
               department text
) 
''')

connection.commit()

#### Inserting the value into the table

In [17]:
cursor.execute('''
Insert into employee(id,name,age,department)
               values(01,'Bhavuk',25,'IT')

''')

cursor.execute('''
Insert into employee(id,name,age,department)
               values(02,'Sahil',22,'HR')

''')

cursor.execute('''
Insert into employee(id,name,age,department)
               values(03,'Rahul',25,'IT')

''')

cursor.execute('''
Insert into employee(id,name,age,department)
               values(04,'John',28,'Finance')

''')



connection.commit()

#### Fetching data from DB

In [24]:
cursor.execute("Select * from employee")
rows=cursor.fetchall()

for row in rows:
    print(row)

(1, 'Bhavuk', 25, 'IT')
(2, 'Sahil', 22, 'HR')
(4, 'John', 28, 'Finance')

#### Updating the data

In [19]:
cursor.execute('''
UPDATE employee
Set Name="AK"
               where id=3

''')

connection.commit()

In [20]:
cursor.execute("Select * from employee")
row=cursor.fetchall()

for i in row:
    print(i)

(1, 'Bhavuk', 25, 'IT')
(2, 'Sahil', 22, 'HR')
(3, 'AK', 25, 'IT')
(4, 'John', 28, 'Finance')

#### Delete data

In [22]:
cursor.execute('''
Delete from employee
               where id=3

''')

connection.commit()

In [47]:
cursor.execute('''
Delete from employee''')

connection.commit()

In [48]:
cursor.execute("Select * from employee")
print(cursor.fetchall())
'''
for i in cursor.fetchall():
    print(i)

    '''

[]

'\nfor i in cursor.fetchall():\n    print(i)\n\n    '

#### Multi inseration

In [49]:
data=[(8, 'Sam', 20, 'IT'),(10, 'Park', 25, 'IT'),(9, 'Jack', 25, 'IT')]

cursor.executemany('''Insert into employee(id,name,age,department)
                   values(?,?,?,?)
                   ''',data)

connection.commit()

In [50]:
cursor.execute("Select * from employee")

for i in cursor.fetchall():
    print(i)

(8, 'Sam', 20, 'IT')
(9, 'Jack', 25, 'IT')
(10, 'Park', 25, 'IT')

#### OrderBy

In [52]:
cursor.execute("Select * from employee Order by name DESC")

for i in cursor.fetchall():
    print(i)

(8, 'Sam', 20, 'IT')
(10, 'Park', 25, 'IT')
(9, 'Jack', 25, 'IT')

In [80]:
cursor.execute('''
drop table student''')

connection.commit()

 ### Join
 A JOIN clause combines the records from two tables on the basis of common attributes. The different types of joins are as follows:<br>

INNER JOIN (OR JOIN) – Gives the records that have common attributes in both tables. <br>
LEFT JOIN – Gives all records from the left table and only the common records from the right table.<br>
RIGHT JOIN – Gives all records from the right table and only the common records from the left table.<br>
FULL OUTER JOIN – Gives all records when there is a common attribute in either the left or the right table.<br>
CROSS JOIN – Gives records of one table with all other records of another table.

#### 1. Inner Join

In [81]:
#creating new tables
cursor.executescript('''

Create table student(
                     
                     id integer primary key,
                     name text not null,
                     techerid integer 
                
);
Create table teacher(
                    id integer primary key,
                    name text not null
                    
);                    

Insert into student(id,name,techerid) values          
                   (1,'Bhavuk',2),
                     (2,'sahil',1),
                     (3,'Sumit',1),
                     (4,'Jack',3),
                     (5,'Karin',3),
                     (6,'John',2);

Insert into teacher(id,name) values
                     (1,"Teacher 1"),
                     (2,"Teacher 2"),
                     (3,"Teacher 3");
                     

''')

connection.commit()

In [82]:
cursor.execute("Update student set techerid=null where id=5")
connection.commit()

In [83]:
cursor.execute("Select * from student")

for i in cursor.fetchall():
    print(i)

(1, 'Bhavuk', 2)
(2, 'sahil', 1)
(3, 'Sumit', 1)
(4, 'Jack', 3)
(5, 'Karin', None)
(6, 'John', 2)

In [84]:
cursor.execute("Select * from teacher")

for i in cursor.fetchall():
    print(i)

(1, 'Teacher 1')
(2, 'Teacher 2')
(3, 'Teacher 3')

In [85]:
cursor.execute('''

select s.name,t.name,s.id from student as s inner join  teacher as t on
               s.techerid=t.id


''')
print("ID,")
for i in cursor.fetchall():
    print(i)

ID,
('Bhavuk', 'Teacher 2', 1)
('sahil', 'Teacher 1', 2)
('Sumit', 'Teacher 1', 3)
('Jack', 'Teacher 3', 4)
('John', 'Teacher 2', 6)

#### 2. Left Join

In [86]:
cursor.execute('''

select s.name,t.name,s.id from student as s Left join  teacher as t on
               s.techerid=t.id


''')
print("ID,")
for i in cursor.fetchall():
    print(i)

ID,
('Bhavuk', 'Teacher 2', 1)
('sahil', 'Teacher 1', 2)
('Sumit', 'Teacher 1', 3)
('Jack', 'Teacher 3', 4)
('Karin', None, 5)
('John', 'Teacher 2', 6)

#### 3. Right Join

In [87]:
cursor.execute('''

select s.name,t.name,s.id from student as s right join  teacher as t on
               s.techerid=t.id


''')
print("ID,")
for i in cursor.fetchall():
    print(i)

ID,
('Bhavuk', 'Teacher 2', 1)
('sahil', 'Teacher 1', 2)
('Sumit', 'Teacher 1', 3)
('Jack', 'Teacher 3', 4)
('John', 'Teacher 2', 6)

#### 4. Cross join

In [90]:
cursor.execute('''

select s.name,t.name,s.id from student as s Cross join teacher as t


''')
print("ID,")
for i in cursor.fetchall():
    print(i)

ID,
('Bhavuk', 'Teacher 1', 1)
('Bhavuk', 'Teacher 2', 1)
('Bhavuk', 'Teacher 3', 1)
('sahil', 'Teacher 1', 2)
('sahil', 'Teacher 2', 2)
('sahil', 'Teacher 3', 2)
('Sumit', 'Teacher 1', 3)
('Sumit', 'Teacher 2', 3)
('Sumit', 'Teacher 3', 3)
('Jack', 'Teacher 1', 4)
('Jack', 'Teacher 2', 4)
('Jack', 'Teacher 3', 4)
('Karin', 'Teacher 1', 5)
('Karin', 'Teacher 2', 5)
('Karin', 'Teacher 3', 5)
('John', 'Teacher 1', 6)
('John', 'Teacher 2', 6)
('John', 'Teacher 3', 6)